#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-resource-creation.aws_iam_instance_profile.certbot_profile will be created
  + resource "aws_iam_instance_profile" "certbot_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "certbot-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "certbot-route53-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.aws-resource-creation.aws_iam_policy.certbot_policy will be created
  + resource "aws_iam_policy" "certbot_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Certbot to modify Route 53 records"
      + id               = (known after apply)
      + name             = "certbot-route53-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetChange",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.aws-resource-creation.aws_iam_role.certbot_role will be created
  + resource "aws_iam_role" "certbot_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "certbot-route53-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws-resource-creation.aws_iam_role_policy_attachment.certbot_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "certbot_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "certbot-route53-role"
    }

  # module.aws-resource-creation.aws_instance.K8S_CLUSTER_EC2_INSTANCE[0] will be created
  + resource "aws_instance" "K8S_CLUSTER_EC2_INSTANCE" {
      + ami                                  = "ami-0a7cf821b91bcccbc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mosip-aws"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-node-1"
        }
      + tags_all                             = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-node-1"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
        # (1 unchanged attribute hidden)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = false
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Cluster" = "TF5"
              + "Name"    = "TF5-node-1"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.aws-resource-creation.aws_instance.NGINX_EC2_INSTANCE will be created
  + resource "aws_instance" "NGINX_EC2_INSTANCE" {
      + ami                                  = "ami-0a7cf821b91bcccbc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "certbot-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mosip-aws"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-NGINX-NODE"
        }
      + tags_all                             = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-NGINX-NODE"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "e92047caf1cada118ed02157365218796551bf40"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/sdb"
          + encrypted             = false
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = {
              + "Cluster" = "TF5"
              + "Name"    = "TF5-NGINX-NODE"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = false
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Cluster" = "TF5"
              + "Name"    = "TF5-NGINX-NODE"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_CNAME["ADMIN_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_CNAME" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "admin.tf5.mosip.net"
      + records         = [
          + "api-internal.tf5.mosip.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_CNAME["ESIGNET_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_CNAME" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "esignet.tf5.mosip.net"
      + records         = [
          + "api.tf5.mosip.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_CNAME["MOSIP_HOMEPAGE_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_CNAME" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tf5.mosip.net"
      + records         = [
          + "api-internal.tf5.mosip.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_CNAME["PREREG_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_CNAME" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "prereg.tf5.mosip.net"
      + records         = [
          + "api.tf5.mosip.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_CNAME["RESIDENT_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_CNAME" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "resident.tf5.mosip.net"
      + records         = [
          + "api.tf5.mosip.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_IP["API_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_IP" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.tf5.mosip.net"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_route53_record.MAP_DNS_TO_IP["API_INTERNAL_DNS"] will be created
  + resource "aws_route53_record" "MAP_DNS_TO_IP" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-internal.tf5.mosip.net"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z090954828SJIEL6P5406"
    }

  # module.aws-resource-creation.aws_security_group.security-group["K8S_SECURITY_GROUP"] will be created
  + resource "aws_security_group" "security-group" {
      + arn                    = (known after apply)
      + description            = "Rules which allow the outgoing traffic from the instances associated with the security group K8S_SECURITY_GROUP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rules which allow the incoming traffic to the instances associated with the security group."
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP port"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS port"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "K8s port"
              + from_port        = 6443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH login port"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-K8S_SECURITY_GROUP"
        }
      + tags_all               = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-K8S_SECURITY_GROUP"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws-resource-creation.aws_security_group.security-group["NGINX_SECURITY_GROUP"] will be created
  + resource "aws_security_group" "security-group" {
      + arn                    = (known after apply)
      + description            = "Rules which allow the outgoing traffic from the instances associated with the security group NGINX_SECURITY_GROUP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Rules which allow the incoming traffic to the instances associated with the security group."
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP port"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS port"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Minio console port"
              + from_port        = 9000
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Postgres port"
              + from_port        = 5432
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH login port"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-NGINX_SECURITY_GROUP"
        }
      + tags_all               = {
          + "Cluster" = "TF5"
          + "Name"    = "TF5-NGINX_SECURITY_GROUP"
        }
      + vpc_id                 = (known after apply)
    }

  # module.nginx-setup.null_resource.Nginx-setup will be created
  + resource "null_resource" "Nginx-setup" {
      + id       = (known after apply)
      + triggers = {
          + "node_hash"       = (known after apply)
          + "public_dns_hash" = "9ae6ac844676393a9bf5223c9120de84"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + K8S_CLUSTER_PRIVATE_IPS                 = {
      + TF5-node-1 = (known after apply)
    }
  + K8S_CLUSTER_PUBLIC_IPS                  = {
      + TF5-node-1 = (known after apply)
    }
  + MOSIP_K8S_CLUSTER_NODES_PRIVATE_IP_LIST = (known after apply)
  + MOSIP_K8S_SG_ID                         = (known after apply)
  + MOSIP_NGINX_SG_ID                       = (known after apply)
  + MOSIP_PUBLIC_DOMAIN_LIST                = "api.tf5.mosip.net,esignet.tf5.mosip.net,prereg.tf5.mosip.net,resident.tf5.mosip.net"
  + NGINX_PRIVATE_IP                        = (known after apply)
  + NGINX_PUBLIC_IP                         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @syedsalman3753, Action: `pull_request`*